# SQL 4 Data Science: Predict Project
## Bhejane Online Trading Store

### Student Starter Notebook

Â© Explore Data Science Academy

### Honour Code

I Sanele Zulu, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

<a id='Context'></a>
### 1. Context

The Bhejane trading store is an online retailer specialising in Covid essential items. The store has recently been struggling with the management of its database-related inventory system. Luckily for them, you've been hired as a consultant to fix the problem. 

Its time to flex your Ninja SQL skills! 
 
**Your mission, should you choose to accept it:**

You will receive a denormalised database consisting of two tables. Your task is to transform the database such that is in third normal form (3NF). To ensure that a consistent normalisation process is followed by each student, we have attached an Entity Relationship Diagram (ERD) which is a guideline on what tables need to be produced. Once you have normalised the database, you will be required to complete an MCQ test found under the 'Predict' tab of Athena.  

Though the normalisation process, you will be guided into acknowledging client (Bhenjane Trading) use-cases for the database, and dealing with data anomalies in SQL.

![Bhejane company logo](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/Bhejane.png)

<div align="center" >
    Bhejane, or the Black Rhino. Image by <a href="https://commons.wikimedia.org/wiki/File:Black_Rhino_(Diceros_bicornis)_browsing_..._(46584052962).jpg">Wikimedia Commons</a>
</div>

<a id='Imports'></a>
### 2. Imports
Please use the below command to install sql_magic, this is the package that will assist you with SQL syntax hightlighting.
* pip install sql_magic

Remember to start each new cell with " %%read_sql "

In [4]:
# DO NOT EDIT THIS CELL
import sqlite3
import csv
from sqlalchemy import create_engine
%load_ext sql_magic

# Load SQLite database
engine  = create_engine("sqlite:///bhejane.db")
%config SQL.conn_name ='engine'

<a id='Data_description'></a>
### 3. Data description

The original database consist of 2 tables. 
* Product Table
* Transaction Table

The `Product` table consists of the stock of all inventory that Bhejane has on hand currently, or has had on hand historically. Items which are in this table are able to be purchased, and a record of all sales (transactions) in 2020 is notorised in the `Transactions` table. To link the tables - the `barcode` can be used. Any item in the `Transactions` table, must therefore appear in the `Products` table.

In [9]:
# DO NOT EDIT THIS CELL
import pandas as pd
data_description = pd.read_excel('Data Description.xlsx')
data_description

FileNotFoundError: [Errno 2] No such file or directory: 'Data Description.xlsx'

<a id='Setting_up'></a>
### 4. Setting up the database

In [4]:
#DO NOT EDIT THIS CELL
conn = sqlite3.connect('bhejane.db')
cursor = conn.cursor()

#### Creating both Products and Transaction Tables

In [4]:
%%read_sql
--DO NOT EDIT THIS CELL
DROP TABLE IF EXISTS "Products";
DROP TABLE IF EXISTS "Transactions";

CREATE TABLE "Products" (
    "Width"   REAL,
    "Length"  REAL,
    "Height"  REAL,
    "Barcode" VARCHAR(150),
    "Quantity" REAL,
    "Brand" VARCHAR(150), 
    "NavigationPath" VARCHAR(150),
    "Colour" VARCHAR(150),
    "StockCountry" VARCHAR(150),
    "ProductDescription" VARCHAR(150),
    "PackType" VARCHAR(150), 
    "Volume_litre" REAL, 
    "Warranty" VARCHAR(150), 
    "Weight_kg" REAL,
    "ItemDescription" VARCHAR(150), 
    "Price" REAL
);


CREATE TABLE "Transactions" (
    "CartID" INTEGER,
    "Barcode" VARCHAR(150), 
    "Total" REAL,
    "UserName" VARCHAR(150), 
    "InvoiceDate" DATETIME
);

Query started at 10:38:49 PM South Africa Standard Time; Query executed in 0.00 m

#### Load Data into Product and Transaction tables

Although we have not yet covered python in the sprint at EXPLORE - you have additional resources at your disposal, one of which happens to be a data engineering expert, and she has created a brief script for you which can be used to extract the data from the csv files, and load it into a sqlite database. 

This will be included in your submission, so that the end-to-end processing of the data is visible, and repeatable for any additional consultants who may be brought on board at a later stage.

In [5]:
# DO NOT EDIT CELL
#Load data into Product table
with open('bhejane_covid_essentials_Products.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['Width'],i['Length'],i['Height'], i['Barcode'], i['Quantity'], i['Brand'], i['NavigationPath'], i['Colour'], i['StockCountry'], i['ProductDescription'],i['PackType'],i['Volume_litre'],i['Warranty'],i['Weight_kg'],i["ItemDescription"],i['Price']) for i in dr]

cursor.executemany("INSERT INTO Products VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);", to_db)
conn.commit()

with open('bhejane_covid_essentials_Transactions.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['CartID'],i['Barcode'], i['Total'], i['UserName'], i['InvoiceDate']) for i in dr]

cursor.executemany("INSERT INTO Transactions VALUES (?, ?, ?, ?, ?);", to_db)
conn.commit()

<a id='ERD'></a>
### 5. Denormalized Database Tables

<br>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/Denormalized_Tables.png" alt="Denormalized Tables" border="0">

#### 5.1 Explore the Denormalized Tables
Familiarize yourself with the data given in the two tables by writing your own SQL queries to explore properties of the dataset.i.e Look for data inconsistencies, anormalies, redundancies etc to guide your normalization process. 

This section will not be graded - think of it as your own scratch pad.

In [6]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT * FROM Products
LIMIT 2;

Query started at 10:38:56 PM South Africa Standard Time; Query executed in 0.00 m

,Width,Length,Height,Barcode,Quantity,Brand,NavigationPath,Colour,StockCountry,ProductDescription,PackType,Volume_litre,Warranty,Weight_kg,ItemDescription,Price
0,,,,300507946,493.0,Hikvision,Computers & Tablets / Smart Home & Connected L...,,,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,,0.0,Limited (6 months),,1 x Hikvision 1080P Bullet camera,399.0
1,,,,300507946,493.0,Hikvision,Computers & Tablets / Smart Home & Connected L...,,,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,,0.0,Limited (6 months),,Manual,399.0

### 6. Normalize the given Database tables to the 1st Normal Form (1NF)

Given the below below target ERD create new tables such the the database conforms to the 1st Normal Form

![1st Normal Form](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/1stNF.png)


It is suggested that you create all your tables before attempting to populate them with data, this will help reduce errors that might creep up due to logical dependencies.

#### 6.1 Create the tables required for the 1st Normal Form
Use the above ERD sketch to create the required tables. Please label your tables as they appear in the ERD sketch

In [7]:
%%read_sql
--#Create tables required for 1NF
DROP TABLE IF EXISTS "Products_1NF";
DROP TABLE IF EXISTS "Transactions_1NF";

CREATE TABLE "Products_1NF"(
    "Barcode" VARCHAR(150),
    "NavigationPath" VARCHAR(150),
    "ItemDescription" VARCHAR(150),
    "Colour" VARCHAR(150),
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Brand" VARCHAR(150),
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "PackType" VARCHAR(150),
    "Warranty" VARCHAR(150),
    "StockCountry" VARCHAR(150),
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    PRIMARY KEY("Barcode","NavigationPath","ItemDescription")
);

CREATE TABLE "Transactions_1NF" (
    "CartID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "UserName" VARCHAR(150) NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    FOREIGN KEY ("Barcode") REFERENCES "Products_1NF" ("Barcode"),
    PRIMARY KEY("CartID", "Barcode", "UserName")
);

Query started at 10:38:59 PM South Africa Standard Time; Query executed in 0.00 m

#### 6.2 Populate the tables you have create in the above section.

Populate the tables such that the database conforms to the 1st Normal Form

In [8]:
%%read_sql
--#Populate the 1NF tables
DELETE FROM "Products_1NF";
DELETE FROM "Transactions_1NF";

INSERT INTO "Products_1NF" ("Barcode","NavigationPath","ItemDescription","Colour","ProductDescription","Brand",
                            "Price","Quantity","PackType","Warranty","StockCountry","Weight_kg",
                            "Volume_litre","Length","Width","Height")
SELECT DISTINCT
     Barcode
    ,NavigationPath
    ,ItemDescription
    ,Colour
    ,ProductDescription
    ,Brand
    ,Price
    ,Quantity
    ,PackType
    ,Warranty
    ,StockCountry
    ,Weight_kg
    ,Volume_litre
    ,Length
    ,Width
    ,Height 
FROM 
    Products;

INSERT INTO "Transactions_1NF"("CartID","Barcode","UserName","InvoiceDate","Total")
SELECT DISTINCT 
    CartID
    ,Barcode
    ,UserName
    ,InvoiceDate
    ,Total
FROM
    Transactions;

Query started at 10:39:07 PM South Africa Standard Time; Query executed in 0.00 m

###  7. Convert the database into its 2nd Normal Form (2NF).

Please label your tables as they appear in the ERD sketch.

#### 7.1 Entity Relationship Diagram

![2nd Normal Form](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/2ndNF.png)

#### 7.2 2NF Requirements
To transition from 1NF to 2NF, we need all columns in all tables to not have a partial dependancy on the PK of the table. This means that any tables which have a composite key e.g. `PRIMARY KEY("Barcode","NavigationPath","ItemDescription")` cannot have columns in the table which are dependant on only `Barcode`, `NavigationPath`, or `ItemDescription`. 

In moving to 2NF we will seperate out each of these as a primary key (for their own respective tables), and any columns dependant on one of these columns but not the others, will go into that table. The only columns remaining in the tables will be fully functionally dependant on the primary key of the table. For example, 

Thereby, we remove the partial dependancy, and will be in 2NF. We are instructed to create a unique identifier for the `Transactions_2NF`. 

**Second normal form notes**

<br>$\bullet$ Notice that `Total` is only dependant on `CartID` and not on `<CartID,barcode>`. This is a partial dependancy
<br>$\bullet$ Second normal form required no *partial functional dependancy* on the key. 
<br>$\bullet$ This can be achieved in 2 ways: create a unique identifier per row (so that there is a simple primary key), or break the table up into only the columns which are fully dependant on the composite key. 
<br>$\bullet$ We are going to opt for the easier solution, and create a unique simple primary key on the `Transactions_1NF`. We can create a unique primary key by concatenating `CartID||barcode`
<br>$\bullet$ NB - this approach does make it more challenging to get into 3NF! Which would be a good argument to opt for the latter approach.

#### 7.3 Data Anomalies

You may stumble into an error when you insert the data which violates this constraint. You query this with the data owner, and you are told that there are three transactions in the database which were errors. You are informed that *all transactions in the database correspond to products are in the database*.

These entries were captured incorrectly, and must be removed. How will you deal with this?

In [9]:
%%read_sql
select count(distinct barcode) from Transactions_1NF where barcode not in (select barcode from products_1NF)

Query started at 10:39:16 PM South Africa Standard Time; Query executed in 0.00 m

   count(distinct barcode)
0                        2

### <font color='turquoise'>Action: remove the affected entries with a `delete` query </font>

In [10]:
%%read_sql
delete from Transactions_1NF where barcode not in (select barcode from products_1NF)

Query started at 10:39:20 PM South Africa Standard Time; Query executed in 0.00 m

In [11]:
%%read_sql
select count(distinct barcode) from Transactions_1NF where barcode not in (select barcode from products_1NF)

Query started at 10:39:27 PM South Africa Standard Time; Query executed in 0.00 m

   count(distinct barcode)
0                        0

#### 7.4 FK Requirements

_Note: sqlite does not always enforce foreign key constraints (and it is even more inconsistent with magic commands to enforce FK constraints!), so it is critical that you understand the purpose of the foreign key constraint and therefore are able to enforce the FK constraint yourself!_

To enforce data integrity, and to ensure that strange things cannot happen - we will have a FK constraint. A foreign key forces all values of the FK, to be limited to only the values which exist as entries in the PK column of the table for which the aforementioned table is a foreign key to. For example, we cannot sell a product (in our Transactions table) which we do not have in our Products table. 

You will need to work around this by removing the erroneous data from the tables before continuing, since this would violate the FK constraint between the Transactions_2NF and Products_2NF table otherwise. 

_Hint: Identify the observations in the Transactions_1NF table, and remove them from there._

#### 7.5 Client Use-Case Requirements

The data owner has advised that there were several instances of incorrect data capturing. Whenever data was partially captured, it was redone, but the partially-complete entries have not been removed from the database. 

For all tables which are going to be used, consider the table utility relative to the Products (Products_2NF) table. You are tasked with removing 'useless' entries as you take the data from 1NF to 2NF. For the sake of ease-of-use for the client, we will removing all rows in the 2NF tables `PackageContents_2NF` and `Colours_2NF` which have an empty value for the attributes that the client will use them for - these are the `ItemDescription` and `Colour` columns, respectively. 

_Hint: Make inserts into the other 2NF (`PackageContents_2NF` and `Colours_2NF`) tables using a `where` clause to remove instances of the value being an empty string, or a `null` value. This will need to be considered for the `ItemDescription` and for the `Colour` when data is inserted into the corresponding tables above (i.e. only insert data into the `PackageContents_2NF` which has a value for the `ItemDescription`, and only insert data into the `Colours_2NF` table which has a value for `Colour`_

### <font color='turquoise'>Action: Investigate these anomalies for the tables mentioned </font>

In [12]:
%%read_sql 

SELECT DISTINCT 
    ItemDescription,
    PackType,
    Warranty 
FROM
    Products
WHERE ItemDescription = '';

Query started at 10:39:33 PM South Africa Standard Time; Query executed in 0.00 m

   ItemDescription PackType              Warranty
0                              Limited (6 months)
1                                  Non-Returnable
2                             Limited (12 months)
3                            Limited (120 months)
4                            Limited (180 months)
5                             Limited (18 months)
6                            Supplier (12 months)
7                    Single    Limited (6 months)
8                             Limited (24 months)
9
10                            Limited (36 months)
11                                Full (6 months)

### Let's do it! Construct the database above in second normal form

In [70]:
%%read_sql
--#Create tables required for 2NF

DROP TABLE IF EXISTS "Products_2NF";
DROP TABLE IF EXISTS "Transactions_2NF";
DROP TABLE IF EXISTS "Navigation_2NF";
DROP TABLE IF EXISTS "PackageContents_2NF";
DROP TABLE IF EXISTS "Colours_2NF";

CREATE TABLE Products_2NF(
    "RegistryID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Brand" VARCHAR(150),
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "StockCountry" VARCHAR(150),
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    "PathID" INTEGER,
    "ItemID" INTEGER,
    "ColourID" INTEGER,
    PRIMARY KEY(RegistryID AUTOINCREMENT),
    CONSTRAINT fk_nav FOREIGN KEY('PathID') REFERENCES Navigation_2NF ('PathID'),
    CONSTRAINT fk_pack FOREIGN KEY('ItemID') REFERENCES PackageContents_2NF ('ItemID'),
    CONSTRAINT fk_col FOREIGN KEY('ColourID') REFERENCES Colours_2NF ('ColourID') 
);

CREATE TABLE "Transactions_2NF" (
    "CartID||Barcode||UserName" VARCHAR(150) NOT NULL,
    "CartID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "UserName" VARCHAR(150) NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    PRIMARY KEY("CartID||Barcode||UserName")
    CONSTRAINT fk_trans FOREIGN KEY('Barcode') REFERENCES Products_2NF ('Barcode')
);


CREATE TABLE "Navigation_2NF"(
    "PathID" INTEGER NOT NULL,
    "NavigationPath" VARCHAR(150),
    PRIMARY KEY("PathID" AUTOINCREMENT)
);

CREATE TABLE "Colours_2NF"(
    "ColourID" INTEGER NOT NULL,
    "Colour" VARCHAR(150),
    PRIMARY KEY("ColourID" AUTOINCREMENT)
);

CREATE TABLE "PackageContents_2NF"(
    "ItemID" INTEGER NOT NULL,
    "ItemDescription" VARCHAR(150),
    "PackType" VARCHAR(150),
    "Warranty" VARCHAR(150),
    PRIMARY KEY("ItemID" AUTOINCREMENT)
);

Query started at 12:23:53 AM South Africa Standard Time; Query executed in 0.00 m

### Let's do it! _Populate_ the database above in second normal form

Firstly, let's consider the entries which are `null` and `= ''`. And we will only insert the relevant entries.

In [71]:
%%read_sql
-- #Populate the tables so that they conform to 2NF

DELETE FROM "Products_2NF";
DELETE FROM "Transactions_2NF";
DELETE FROM "Navigation_2NF";
DELETE FROM "PackageContents_2NF";
DELETE FROM "Colours_2NF";


INSERT INTO "Navigation_2NF"("NavigationPath")
SELECT DISTINCT 
    NavigationPath 
FROM
    Products_1NF;
    
INSERT INTO "PackageContents_2NF"("ItemDescription","PackType","Warranty")
SELECT DISTINCT 
    ItemDescription,
    PackType,
    Warranty 
FROM
    Products_1NF
WHERE ItemDescription <> ''
        ;
    
INSERT INTO "Colours_2NF"("Colour")
SELECT DISTINCT 
    Colour
FROM
    Products_1NF
WHERE Colour <> ''
        ;

Query started at 12:23:59 AM South Africa Standard Time; Query executed in 0.00 m

A more complicated scenario below as we insert into `Products_2NF`. We will insert from the Products_1NF table. We can use LEFT JOIN, because the data in each of these tables that `Products_1NF` has a FK to, originally came from `Products_1NF`, so we are gauranteed to get matches back. Normally however, what you would get from the FK restriction is the requirement to use _parent-table_ `LEFT JOIN` _child-table_.

In [72]:
%%read_sql 
DELETE FROM "Products_2NF";
INSERT INTO "Products_2NF" ("PathID","ItemID","ColourID","Barcode","ProductDescription","Brand","Price",
                            "Quantity","StockCountry","Weight_kg","Volume_litre",
                            "Length","Width","Height")
SELECT
    PathID,
    ItemID,
    ColourID,
    Products_1NF.Barcode,
    ProductDescription,
    Brand,
    Price,
    Quantity,
    StockCountry,
    Weight_kg, 
    Volume_litre, 
    Length,
    Width,
    Height 
FROM 
    Products_1NF
LEFT JOIN Navigation_2NF ON Products_1NF.NavigationPath = Navigation_2NF.NavigationPath 
LEFT JOIN PackageContents_2NF ON Products_1NF.ItemDescription = PackageContents_2NF.ItemDescription
LEFT JOIN Colours_2NF ON Products_1NF.Colour = Colours_2NF.Colour;

Query started at 12:24:01 AM South Africa Standard Time; Query executed in 0.00 m

Last but not least, we insert into the `Transactions_2NF`table. Recall that we created a new PK in this table, and pay attention to how we are inserting values into the table.

In [73]:
%%read_sql 
DELETE FROM "Transactions_2NF";
INSERT INTO "Transactions_2NF"("CartID||Barcode||UserName","CartID","Barcode","UserName","InvoiceDate","Total")
SELECT DISTINCT 
    CartID||Transactions_1NF.Barcode||UserName
    ,CartID
    ,Products_2NF.Barcode
    ,UserName
    ,InvoiceDate
    ,Total
FROM
    Transactions_1NF
LEFT JOIN Products_2NF ON Transactions_1NF.Barcode = Products_2NF.Barcode ;

Query started at 12:24:07 AM South Africa Standard Time; Query executed in 0.00 m

<a id='Target_ERD'></a>
### 8. Convert the table into its 3rd Normal Form (3NF)

Please label your tables as they appear in the ERD sketch. In the same fashion as done in 2NF, note which tables need to have data inserted `where column <> '' and column is not null`.

<br>

![3rd Normal Form](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/3rdNF.png)

In [149]:
%%read_sql

DROP TABLE IF EXISTS "Carts_3NF";
DROP TABLE IF EXISTS "Products_3NF";
DROP TABLE IF EXISTS "Users_3NF";

CREATE TABLE "Products_3NF" (
    "RegistryID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    "PathID" INTEGER,
    "ItemID" INTEGER,
    "ColourID" INTEGER,
    "BrandID" INTEGER,
    "LocationID" INTEGER,
    PRIMARY KEY("RegistryID" AUTOINCREMENT),
    CONSTRAINT fk_nav3 FOREIGN KEY('PathID') REFERENCES Navigation_3NF ('PathID'),
    CONSTRAINT fk_pack3 FOREIGN KEY('ItemID') REFERENCES PackageContents_3NF ('ItemID'),
    CONSTRAINT fk_col3 FOREIGN KEY('ColourID') REFERENCES Colours_3NF ('ColourID'),
    CONSTRAINT fk_bra FOREIGN KEY('BrandID') REFERENCES Brands_3NF ('BrandID'),
    CONSTRAINT fk_loc FOREIGN KEY('LocationID') REFERENCES Locations_3NF ('LocationID')

);


CREATE TABLE "Carts_3NF" (
    "CartID" INTEGER NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    PRIMARY KEY ("CartID")
);


CREATE TABLE "Users_3NF"(
    "UserID" INTEGER NOT NULL,
    UserName VARCHAR(50) NOT NULL,
    PRIMARY KEY("UserID" AUTOINCREMENT)
);

Query started at 12:40:16 AM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the construction of the remaining tables mentioned </font>

In [150]:
%%read_sql
DROP TABLE IF EXISTS "Transactions_3NF";
DROP TABLE IF EXISTS "Navigation_3NF";
DROP TABLE IF EXISTS "Colours_3NF";
DROP TABLE IF EXISTS "Brands_3NF";
DROP TABLE IF EXISTS "Locations_3NF";
DROP TABLE IF EXISTS "PackageContents_3NF";

CREATE TABLE "Transactions_3NF" (
    "CartID||Barcode||UserName" VARCHAR(150) NOT NULL,
    "CartID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "UserID" VARCHAR(150) NOT NULL,
    PRIMARY KEY("CartID||Barcode||UserName"),
    CONSTRAINT fk_trans FOREIGN KEY('Barcode') REFERENCES Products_2NF ('Barcode'),
    CONSTRAINT fk_car FOREIGN KEY("CartID") REFERENCES "Carts_3NF" ("CartID"),
    CONSTRAINT FK_usid FOREIGN KEY("UserID") REFERENCES "Users_3NF" ("UserID")
);
    
CREATE TABLE "Navigation_3NF"(
    "PathID" INTEGER NOT NULL,
    "NavigationPath" VARCHAR(150),
    PRIMARY KEY("PathID" AUTOINCREMENT)
);

CREATE TABLE "PackageContents_3NF"(
    "ItemID" INTEGER NOT NULL,
    "ItemDescription" VARCHAR(150),
    "PackType" VARCHAR(150),
    "Warranty" VARCHAR(150),
    PRIMARY KEY("ItemID" AUTOINCREMENT)
);

CREATE TABLE "Colours_3NF"(
    "ColourID" INTEGER NOT NULL,
    "Colour" VARCHAR(150),
    PRIMARY KEY("ColourID" AUTOINCREMENT)
); 

CREATE TABLE "Brands_3NF"(
    "BrandID" INTEGER NOT NULL,
    "Brand" VARCHAR(150),
    PRIMARY KEY("BrandID" AUTOINCREMENT)
);
    
CREATE TABLE "Locations_3NF"(
    "LocationID" INTEGER NOT NULL,
    "StockCountry" VARCHAR(150),
    PRIMARY KEY("LocationID" AUTOINCREMENT)
);

Query started at 12:40:17 AM South Africa Standard Time; Query executed in 0.00 m

In [151]:
%%read_sql
DELETE FROM "Users_3NF";

INSERT INTO "Users_3NF" ("UserName")
SELECT DISTINCT UserName FROM Transactions_2NF;

Query started at 12:40:18 AM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the insertion into `Carts_3NF`.   </font>

Take note that there are duplicate values coming from `Transactions_2NF` - retain the `distinct` combinations of `CartID`,`InvoiceDate`,`Total` only.

In [152]:
%%read_sql
DELETE FROM "Carts_3NF";
INSERT INTO "Carts_3NF"("CartID","InvoiceDate","Total")
    SELECT DISTINCT CartID, InvoiceDate, Total
    FROM Transactions_2NF;

Query started at 12:40:20 AM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the insertion into the tables below. </font>

Similarly to the table above, mind the occurances of duplicate entries. These can be avoided by using `SELECT distinct` to avoid inserting redundant rows.

In [153]:
%%read_sql
DELETE FROM "Navigation_3NF";
DELETE FROM "PackageContents_3NF";
DELETE FROM "Colours_3NF";
DELETE FROM "Brands_3NF";
DELETE FROM "Locations_3NF";

INSERT INTO "Locations_3NF" ("StockCountry")
    SELECT DISTINCT StockCountry
    FROM Products_2NF
    WHERE StockCountry != '';

INSERT INTO "Brands_3NF" ("Brand")
    SELECT DISTINCT Brand
    FROM Products_2NF
    WHERE Brand != '';

INSERT INTO "Colours_3NF" ("Colour")
    SELECT DISTINCT Colour
    FROM Colours_2NF;
    
INSERT INTO "PackageContents_3NF" ("ItemDescription","PackType","Warranty")
    SELECT DISTINCT ItemDescription, PackType, Warranty
    FROM PackageContents_2NF;
    
INSERT INTO "Navigation_3NF" ("NavigationPath")
    SELECT DISTINCT NavigationPath
    FROM Navigation_2NF;

Query started at 12:40:21 AM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the insertion into `Products_3NF`. </font>
Take note of the joins required for additional data contained in other tables.

In [154]:
%%read_sql


INSERT INTO "Products_3NF" ("Barcode","ProductDescription","Price",
                            "Quantity","Weight_kg","Volume_litre",
                            "Length","Width","Height", "PathID","ItemID","ColourID","BrandID","LocationID")
SELECT DISTINCT Barcode,ProductDescription,Price, Quantity,Weight_kg, Volume_litre, 
Length, Width, Height, Navigation_2NF.PathID,PackageContents_2NF.ItemID, Colours_2NF.ColourID, LocationID, BrandID 

 FROM Products_2NF 
LEFT JOIN Navigation_2NF ON Products_2NF.PathID = Navigation_2NF.PathID 
LEFT JOIN PackageContents_2NF ON Products_2NF.ItemID = PackageContents_2NF.ItemID
LEFT JOIN Colours_2NF ON Products_2NF.ColourID = Colours_2NF.ColourID
LEFT JOIN Brands_3NF ON Products_2NF.Brand = Brands_3NF.Brand
LEFT JOIN Locations_3NF ON Products_2NF.StockCountry = Locations_3NF.StockCountry;

Query started at 12:40:23 AM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the insertion into `Transactions_3NF`.   </font>

Follow previous proceedure, and checks.

In [155]:
%%read_sql

INSERT INTO "Transactions_3NF"("CartID||Barcode||UserName","CartID","Barcode","UserID")
SELECT DISTINCT 
    Carts_3NF.CartID||Transactions_2NF.Barcode||Users_3NF.UserName,
    Carts_3NF.CartID,
    Transactions_2NF.Barcode,
    Users_3NF.UserID
    
FROM
    Transactions_2NF
    LEFT JOIN Products_3NF ON Transactions_2NF.Barcode = Products_3NF.Barcode 
    LEFT JOIN Carts_3NF ON Transactions_2NF.InvoiceDate = Carts_3NF.InvoiceDate 
    AND Transactions_2NF.Total = Carts_3NF.Total
    LEFT JOIN Users_3NF ON Transactions_2NF.UserName = Users_3NF.UserName;

Query started at 12:40:24 AM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: Investigate the DB.   </font>

Note - the tables counts below are what you should arrive at. If you don't, reconsider how you have done the inserts above. Having the tables correctly formatted will allow to answer the questions more easily, and without errors.

In [156]:
%%read_sql 

-- How many entries are here in each of the tables in the database now? 
select '3. Products_3NF' as table_name, count(*) from Products_3NF
UNION
select '3. Transactions_3NF' as table_name, count(*) from Transactions_3NF
UNION
select '3. Users_3NF' as table_name, count(*) from Users_3NF
UNION
select '3. Navigation_3NF' as table_name, count(*) from Navigation_3NF
UNION
select '3. PackageContents_3NF' as table_name, count(*) from PackageContents_3NF
UNION
select '3. Colours_3NF' as table_name, count(*) from Colours_3NF
UNION
select '3. Brands_3NF' as table_name, count(*) from Brands_3NF
UNION
select '3. Locations_3NF' as table_name, count(*) from Locations_3NF
UNION
select '3. Carts_3NF' as table_name, count(*) from Carts_3NF

Query started at 12:40:26 AM South Africa Standard Time; Query executed in 0.00 m

               table_name  count(*)
0           3. Brands_3NF       232
1            3. Carts_3NF       190
2          3. Colours_3NF        17
3        3. Locations_3NF         2
4       3. Navigation_3NF       396
5  3. PackageContents_3NF       600
6         3. Products_3NF      1214
7     3. Transactions_3NF       275
8            3. Users_3NF       158

<a id='MCQ_questions'></a>
## 9. MCQ Questions

Having completed the normalisation of the database, you may use the following cells to help you answer the MCQs for the predict.

Q1) How many unique products does the company have?

In [157]:
%%read_sql

SELECT COUNT(*)
FROM (SELECT DISTINCT(Barcode)
     FROM Products_3NF);

Query started at 12:40:30 AM South Africa Standard Time; Query executed in 0.00 m

   COUNT(*)
0       608

Q2) How many users bought from Bhejane in April 2020?

In [158]:
%%read_sql
SELECT COUNT(*)
FROM (SELECT DISTINCT UserName
     FROM Users_3NF
     INNER JOIN Transactions_3NF
     ON Users_3NF.UserID = Transactions_3NF.UserID
     INNER JOIN Carts_3NF
      ON Transactions_3NF.CartID = Carts_3NF.CartID
     WHERE SUBSTR(InvoiceDate,1,4) == '2020' 
     AND SUBSTR(InvoiceDate,6,2) == '04');

Query started at 12:40:32 AM South Africa Standard Time; Query executed in 0.00 m

   COUNT(*)
0        31

Q3) How many users bought 3 or more items that cost more than R1000?

In [159]:
%%read_sql
SELECT COUNT(*) AS 'Number of Items'

FROM (SELECT  UserID,Barcode, Total, InvoiceDate
      FROM Transactions_3NF
      INNER JOIN Carts_3NF
      ON Transactions_3NF.CartID = Carts_3NF.CartID
      GROUP BY UserID,InvoiceDate
      HAVING COUNT(Barcode) >= 3 
      AND Total > 1000);

Query started at 12:40:34 AM South Africa Standard Time; Query executed in 0.00 m

   Number of Items
0               11

Q4) Which user made the largest purchase on a single transaction?

In [160]:
%%read_sql
SELECT UserName, Total

FROM (SELECT  Users_3NF.UserName, Users_3NF.UserID, Transactions_3NF.Barcode, Carts_3NF.Total, Carts_3NF.InvoiceDate
      FROM Transactions_3NF
      INNER JOIN Users_3NF
      ON Transactions_3NF.UserID = Users_3NF.UserID
      INNER JOIN Carts_3NF
      ON Transactions_3NF.CartID = Carts_3NF.CartID
      GROUP BY Carts_3NF.InvoiceDate,Users_3NF.UserID
      ORDER BY Carts_3NF.Total DESC)
LIMIT 2;

Query started at 12:40:36 AM South Africa Standard Time; Query executed in 0.00 m

   UserName    Total
0    Mandla  10999.0
1  Brigette  10999.0

Q5) How many components does the product: "5m Colour Changing RGB LED Strip Light" (MPTAL57588104) come with?

In [161]:
%%read_sql
SELECT COUNT(*)
FROM (SELECT DISTINCT(ItemDescription)
      FROM PackageContents_3NF
     INNER JOIN Products_3NF
     ON PackageContents_3NF.ItemID = Products_3NF.ItemID
     WHERE Barcode = 'MPTAL57588104') ;

Query started at 12:40:37 AM South Africa Standard Time; Query executed in 0.00 m

   COUNT(*)
0         4

Q6) How many brands are available at Bhejane?

In [162]:
%%read_sql
SELECT COUNT(*)
FROM Brands_3NF;

Query started at 12:40:39 AM South Africa Standard Time; Query executed in 0.00 m

   COUNT(*)
0       232

7) What is the price of the "Verimark - Floorwiz 2in1 Mop"?

In [163]:
%%read_sql

SELECT Price, ProductDescription
FROM Products_3NF

WHERE ProductDescription LIKE "%Verimark - Floorwiz 2in1 Mop%"
LIMIT 1;

Query started at 12:40:41 AM South Africa Standard Time; Query executed in 0.00 m

   Price            ProductDescription
0  179.0  Verimark - Floorwiz 2in1 Mop

Q8) Calculate the package volume of the "Russell Hobbs - Slow Cooker" using the given dimensions

In [164]:
%%read_sql

SELECT (Height*Width*Length) AS Volume_Calc
FROM Products_3NF
WHERE ProductDescription LIKE "Russell Hobbs - Slow Cooker"
LIMIT 1;

Query started at 12:40:43 AM South Africa Standard Time; Query executed in 0.00 m

   Volume_Calc
0      26928.0

Q9) Which user made the most transactions in the Year 2020?

In [165]:
%%read_sql

SELECT UserName
FROM (SELECT COUNT(Transactions_3NF.CartID) AS Total_Trans, UserName, Carts_3NF.InvoiceDate, Transactions_3NF.UserID
     FROM Transactions_3NF
     INNER JOIN Users_3NF
     ON Transactions_3NF.UserID = Users_3NF.UserID
      INNER JOIN Carts_3NF
      ON Carts_3NF.CartID = Transactions_3NF.CartID
     WHERE SUBSTR(InvoiceDate,1,4) = '2020'
     GROUP BY Transactions_3NF.UserID
     ORDER BY Total_Trans DESC)
LIMIT 1;

Query started at 12:40:44 AM South Africa Standard Time; Query executed in 0.00 m

   UserName
0  Cornelis

Q10) What is the total number of users that shop at Bhejane?

In [166]:
%%read_sql
SELECT COUNT(*)
FROM(SELECT DISTINCT UserName
    FROM Users_3NF);

Query started at 12:40:46 AM South Africa Standard Time; Query executed in 0.00 m

   COUNT(*)
0       158

Q11) What is the record count for the Colours_3NF Table?

In [167]:
%%read_sql
SELECT COUNT(*)
FROM (SELECT DISTINCT Colour
     FROM Colours_3NF);

Query started at 12:40:47 AM South Africa Standard Time; Query executed in 0.00 m

   COUNT(*)
0        17

Q12) What would the total price be if I had the following items in my cart?
* MPTAL57588104
* 5000394203921
* 6932391917652

In [168]:
%%read_sql
SELECT SUM(Price) as 'Total Price'
FROM (SELECT DISTINCT Price, Barcode
     FROM Products_3NF
     WHERE Barcode in ("MPTAL57588104","5000394203921","6932391917652"));

Query started at 12:40:49 AM South Africa Standard Time; Query executed in 0.00 m

   Total Price
0        734.0

Q13) What is the barcode of the most sold product?

In [169]:
%%read_sql
SELECT Barcode
FROM (SELECT Carts_3NF.CartID, Barcode
     FROM Carts_3NF
     INNER JOIN Transactions_3NF 
     ON Carts_3NF.CartID = Transactions_3NF.CartID
     GROUP BY Barcode
     ORDER BY COUNT(*) DESC)
LIMIT 1;

Query started at 12:40:51 AM South Africa Standard Time; Query executed in 0.00 m

         Barcode
0  4015400541813

Q14) What are the products of Cornelisâ cart on the 2020-06-28 0:00:00?

In [187]:
%%read_sql

SELECT DISTINCT ProductDescription

FROM (SELECT Products_3NF.Barcode, ProductDescription, UserName, InvoiceDate
     FROM Users_3NF
      INNER JOIN Transactions_3NF 
      ON Users_3NF.UserID = Transactions_3NF.UserID
      INNER JOIN Products_3NF 
      ON Transactions_3NF.Barcode = Products_3NF.Barcode
      INNER JOIN Carts_3NF
      ON Transactions_3NF.CartID = Carts_3NF.CartID
     )
     
WHERE UserName LIKE 'Cornelis' 
AND (SUBSTR(InvoiceDate,1,4) = '2020' AND SUBSTR(InvoiceDate,6,2) = '06' AND SUBSTR(InvoiceDate,9,2) = '28');

Query started at 01:08:42 AM South Africa Standard Time; Query executed in 0.00 m

                                  ProductDescription
0   Dettol Body Wash - Shower Gel - Original - 600ml
1                       Vitality Aloe Vera Gel 100ml
2  Sparq Active Resistance Loop Band - Set of 5 w...
3                             Protective Face Shield

Q15) Which users bought locally produced, black-coloured products on odd-numbered months of the year, and what was the total cost (rounded to the nearest integer) of the carts containing these products?

In [197]:
%%read_sql

SELECT Price, UserName,InvoiceDate , StockCountry, L.LocationID
     FROM Transactions_3NF AS T
     LEFT JOIN Products_3NF AS P
     ON T.Barcode = P.Barcode
     LEFT JOIN Colours_3NF AS C
      ON C.ColourID = P.ColourID
      LEFT JOIN Locations_3NF AS L
      ON P.LocationID = L.LocationID
      LEFT JOIN Users_3NF AS U
      ON T.UserID = U.UserID
      LEFT JOIN Carts_3NF
     ON T.CartID = Carts_3NF.CartID
      
     -- WHERE StockCountry LIKE "%South Africa%" 
     -- AND Colour LIKE '%Black%' AND (CAST(SUBSTR(InvoiceDate,6,2) AS INT)%2 = 1)

Query started at 01:13:02 AM South Africa Standard Time; Query executed in 0.00 m

     Price  UserName         InvoiceDate  StockCountry  LocationID
0    399.0    DIMPHO  2020-07-02 0:00:00  South Africa         1.0
1    399.0    DIMPHO  2020-07-02 0:00:00  South Africa         1.0
2    149.0   Hendrik  2020-08-05 0:00:00          None         NaN
3     99.0  Faristha  2020-07-29 0:00:00          None         NaN
4     99.0  Faristha  2020-07-29 0:00:00          None         NaN
..     ...       ...                 ...           ...         ...
488  279.0   Heather  2020-04-22 0:00:00          None         NaN
489  279.0   Heather  2020-04-22 0:00:00          None         NaN
490  279.0   Heather  2020-04-22 0:00:00          None         NaN
491  279.0   Heather  2020-04-22 0:00:00          None         NaN
492  279.0   Heather  2020-04-22 0:00:00          None         NaN

[493 rows x 5 columns]

In [198]:
%%read_sql
SELECT *
FROM Products_3NF

Query started at 01:19:33 AM South Africa Standard Time; Query executed in 0.00 m

,RegistryID,Barcode,ProductDescription,Price,Quantity,Weight_kg,Volume_litre,Length,Width,Height,PathID,ItemID,ColourID,BrandID,LocationID
0,1,300507946,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,399.0,493,,0.0,,,,11,1.0,NaN,NaN,1.0
1,2,300507946,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,399.0,493,,0.0,,,,11,2.0,NaN,NaN,1.0
2,3,10325354918,ZEE 3-in-1 Unisex Gaiter,139.0,467,,0.0,,,,1,NaN,1.0,NaN,2.0
3,4,27131187035,Estee Lauder Double Wear Stay In Place Makeup,655.0,275,,0.0,,,,8,NaN,2.0,1.0,3.0
4,5,27131187035,Estee Lauder Double Wear Stay In Place Makeup,655.0,275,,0.0,,,,9,NaN,2.0,1.0,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1209,1210,TAL00035388021,Angelcare - Nappy Bin Refill - 3 Pack,269.0,220,,0.0,,,,396,599.0,7.0,1.0,232.0
1210,1211,TAL00035388021,Angelcare - Nappy Bin Refill - 3 Pack,269.0,220,,0.0,,,,395,599.0,7.0,1.0,232.0
1211,1212,TAL00035388407,Pampers Complete Clean Baby Wipes - 6 x 64 - 3...,159.0,130,,0.0,"19,8","21,3","3,2",15,600.0,4.0,1.0,31.0
1212,1213,TAL00035394505,RCT 650VA Line Interactive UPS,675.0,410,,"10,72678",,,,271,39.0,NaN,1.0,15.0
1213,1214,TAL00035395957,Fujifilm Instax Film plain - Pack of 10,155.0,119,,0.0,,,,38,NaN,NaN,1.0,35.0